kappa-collisions.org
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:{} arch:headline
#+OPTIONS: author:t c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+OPTIONS: email:nil f:t inline:t num:t p:nil pri:nil prop:nil stat:t
#+OPTIONS: tags:t tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+TITLE: Kappa distributions and elastic collisions
#+AUTHOR: William Henney
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+TODO: TODO NEXT STARTED | DONE CANCELED

** Material from Bian (2014)
:PROPERTIES:
:EXPORT_FILE_NAME: comments-on-bian2014
:END:
+ Models of acceleration of solar flares
  + Coronal loops have n = 1e11 pcc, T = 2e7K, length L = 1e9 cm
    + => Kn = 0.005 or so
    + Thermal electron energy is about 2 keV
    + Flares produce deka-keV electrons, so 10 times more energetic than thermal
    + X-ray spectra suggest \(\kappa \simeq 5\)
+ Their Section 5: Spatial transport and escape
  + Isotropization of the distribution function on deflection timescale \(\tau_{D}\)
    + They call this the "pitch-angle scattering timescale"
  + Then pitch-angle dependent diffusion along the field lines
+ From their section 7
  + They derive a relationship for kappa:
    \[ \kappa = \frac{3}{2} \frac{\lambda_{c}}{\lambda} \Bigl(\frac{E_{D}}{E_{\parallel}}\Bigr)^{2} \]
  + where \(\lambda_{c}\) is the collisional mean free path
  + \(\lambda\) is the turbulent mean free path
    + we need to unpack this further, but it seems to be roughly equal to the scale of their system
  + \(E_{D} = k T / e \lambda_{c}\) is the Dreicer field, which is field required to accelerate an electron to the thermal velocity over one mean free path
  + \(E_{\parallel}\) is the accelerating electric field in the flare
  + This has the bizarre property that \(\kappa\) is smaller when the collisional mean free path is smaller
    + /This is an illusion/ (see below). There is a hidden factor of \(\lambda_{c}^{-2}\) in the Dreicer field
  + All this requires that the turbulent pitch-angle scattering timescale is a decreasing function of v
    + Contrast with collisional pitch-angle scattering timescale \(\lambda_{c} / v \sim v^{3}\)
    + If turbulent mean free path \(\lambda(v)\) is independent of v, then this leads to the acceleration time and collisional deacceleration term having the same v dependence: \(\sim v^{3}\).  This allows for convergence towards a stationary kappa distribution
+ In the introduction they have the collision parameter:
  \[
  \Gamma = \frac{4 \pi e^{4} \ln\Lambda n} {m_{e}^{2}}
  \]
  + This is half the \(\alpha_{r}\) from the plasma formulary
  + In terms of which they have a collisional deceleration time:
    \[ \tau_{c}(v) \simeq v^{3} / \Gamma \]
    - More precisely, using the [[id:428A9D53-A4F8-47CF-96C1-53B58F946F38][Plasma Formulary equations]], we have
      \[\tau_{c}(v) = 2.885 v^{3} / \Gamma \]
  + Which would mean collisional mean free path \[\lambda_{c} = 2.885 v^{4}/\Gamma\]
+ *Recasting their equation in terms of Kn*
  + They say in equation (76) that 
    \[
    \kappa = \frac{\Gamma}{2 D_{0}}
    \]
  + This is just repeating their equation (14), where they had it as
    \[
    \kappa = \tau_{acc} / 2 \tau_{c}
    \]
    + where the acceleration time is \(\tau_{acc} = v^{2} / D_{\text{turb}}(v)\) and the turbulent diffusion coefficient has the form \(D_{\text{turb}}(v) = D_{0}/v\)
      + At this point it is just "the diffusion coefficient in velocity space associated with an as yet unspecified stochastic acceleration mechanism."
    + This version makes sense because \(\kappa\) increases as collisions become more important (\(\tau_{c} \to 0\))
  + But then in section 7, they talk about the specific acceleration mechanism and  we get
    \[D_{0} = \frac{e^{2} E_{\parallel}^{2} \lambda} {2 m^{2}}\]
    where \(\lambda\) is turbulent mean free path 
  + So, subbing into the \(\kappa\) equation gives
    \[ \kappa = 2.885  v^{4} m^{2} / \lambda_{c} e^{2} E_{\parallel}^{2} \lambda\]
  + When subbing in the Dreicer field, this gives the equation I give above that seems to have \(\kappa \propto \lambda_{c}\), but because of the hidden dependency of \(E_{D}^{2}\) on \(\lambda_{c}^{-2}\) everything is OK and we really have \(\kappa \propto \lambda_{c}^{-1}\)
  + A better way of presenting things would be to define a length scale: \(z_{E} e E_{\parallel} = 10 k T = 5 m v^{2}\)
    + so that \(z_{E}\) is the distance required for the field \(E_{\parallel}\) to accelerate an electron to 10 times the thermal energy, as required by the flare observations
    + Self-consistency requires that the acceleration region has a size \(L \approx z_{E}\)
  + With that, we get \(\kappa = 0.1154 (L/\lambda_{c}) (L/\lambda)\)
    + It seems that turbulent mfp \(\lambda \approx L\) so that we get \(\kappa \approx 0.1 /\text{Kn}\)
    + So \(\kappa = 5\) requires \(\text{Kn} = 0.02\), which is not too different from the inferred value
    + If we rescale it to \(\text{Kn} = 0.005\) at \(\kappa = 5\), then it becomes \(\kappa \approx 0.025 /\text{Kn}\)
    + Although if turbulent mean free path < size of acceleration region, then this would also make kappa larger for a given Kn





