comments-on-bian2014.tex
% Created 2015-11-22 Sun 22:28
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{William Henney}
\date{\today}
\title{Material from Bian (2014)}
\hypersetup{
 pdfauthor={William Henney},
 pdftitle={Material from Bian (2014)},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.7 (Org mode 8.3.2)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\begin{itemize}
\item Models of acceleration of solar flares
\begin{itemize}
\item Coronal loops have n = 1e11 pcc, T = 2e7K, length L = 1e9 cm
\begin{itemize}
\item => Kn = 0.005 or so
\item Thermal electron energy is about 2 keV
\item Flares produce deka-keV electrons, so 10 times more energetic than thermal
\item X-ray spectra suggest \(\kappa \simeq 5\)
\end{itemize}
\end{itemize}
\item Their Section 5: Spatial transport and escape
\begin{itemize}
\item Isotropization of the distribution function on deflection timescale \(\tau_{D}\)
\begin{itemize}
\item They call this the "pitch-angle scattering timescale"
\end{itemize}
\item Then pitch-angle dependent diffusion along the field lines
\end{itemize}
\item From their section 7
\begin{itemize}
\item They derive a relationship for kappa:
\[ \kappa = \frac{3}{2} \frac{\lambda_{c}}{\lambda} \Bigl(\frac{E_{D}}{E_{\parallel}}\Bigr)^{2} \]
\item where \(\lambda_{c}\) is the collisional mean free path
\item \(\lambda\) is the turbulent mean free path
\begin{itemize}
\item we need to unpack this further, but it seems to be roughly equal to the scale of their system
\end{itemize}
\item \(E_{D} = k T / e \lambda_{c}\) is the Dreicer field, which is field required to accelerate an electron to the thermal velocity over one mean free path
\item \(E_{\parallel}\) is the accelerating electric field in the flare
\item This has the bizarre property that \(\kappa\) is smaller when the collisional mean free path is smaller
\begin{itemize}
\item \emph{This is an illusion} (see below). There is a hidden factor of \(\lambda_{c}^{-2}\) in the Dreicer field
\end{itemize}
\item All this requires that the turbulent pitch-angle scattering timescale is a decreasing function of v
\begin{itemize}
\item Contrast with collisional pitch-angle scattering timescale \(\lambda_{c} / v \sim v^{3}\)
\item If turbulent mean free path \(\lambda(v)\) is independent of v, then this leads to the acceleration time and collisional deacceleration term having the same v dependence: \(\sim v^{3}\).  This allows for convergence towards a stationary kappa distribution
\end{itemize}
\end{itemize}
\item In the introduction they have the collision parameter:
\[
  \Gamma = \frac{4 \pi e^{4} \ln\Lambda n} {m_{e}^{2}}
  \]
\begin{itemize}
\item This is half the \(\alpha_{r}\) from the plasma formulary
\item In terms of which they have a collisional deceleration time:
\[ \tau_{c}(v) \simeq v^{3} / \Gamma \]
\begin{itemize}
\item More precisely, using the \href{kappa-collisions.org}{Plasma Formulary equations}, we have
\[\tau_{c}(v) = 2.885 v^{3} / \Gamma \]
\end{itemize}
\item Which would mean collisional mean free path \[\lambda_{c} = 2.885 v^{4}/\Gamma\]
\end{itemize}
\item \textbf{Recasting their equation in terms of Kn}
\begin{itemize}
\item They say in equation (76) that 
\[
    \kappa = \frac{\Gamma}{2 D_{0}}
    \]
\item This is just repeating their equation (14), where they had it as
\[
    \kappa = \tau_{acc} / 2 \tau_{c}
    \]
\begin{itemize}
\item where the acceleration time is \(\tau_{acc} = v^{2} / D_{\text{turb}}(v)\) and the turbulent diffusion coefficient has the form \(D_{\text{turb}}(v) = D_{0}/v\)
\begin{itemize}
\item At this point it is just "the diffusion coefficient in velocity space associated with an as yet unspecified stochastic acceleration mechanism."
\end{itemize}
\item This version makes sense because \(\kappa\) increases as collisions become more important (\(\tau_{c} \to 0\))
\end{itemize}
\item But then in section 7, they talk about the specific acceleration mechanism and  we get
\[D_{0} = \frac{e^{2} E_{\parallel}^{2} \lambda} {2 m^{2}}\]
where \(\lambda\) is turbulent mean free path
\item So, subbing into the \(\kappa\) equation gives
\[ \kappa = 2.885  v^{4} m^{2} / \lambda_{c} e^{2} E_{\parallel}^{2} \lambda\]
\item When subbing in the Dreicer field, this gives the equation I give above that seems to have \(\kappa \propto \lambda_{c}\), but because of the hidden dependency of \(E_{D}^{2}\) on \(\lambda_{c}^{-2}\) everything is OK and we really have \(\kappa \propto \lambda_{c}^{-1}\)
\item A better way of presenting things would be to define a length scale: \(z_{E} e E_{\parallel} = 10 k T = 5 m v^{2}\)
\begin{itemize}
\item so that \(z_{E}\) is the distance required for the field \(E_{\parallel}\) to accelerate an electron to 10 times the thermal energy, as required by the flare observations
\item Self-consistency requires that the acceleration region has a size \(L \approx z_{E}\)
\end{itemize}
\item With that, we get \(\kappa = 0.1154 (L/\lambda_{c}) (L/\lambda)\)
\begin{itemize}
\item It seems that turbulent mfp \(\lambda \approx L\) so that we get \(\kappa \approx 0.1 /\text{Kn}\)
\item So \(\kappa = 5\) requires \(\text{Kn} = 0.02\), which is not too different from the inferred value
\item If we rescale it to \(\text{Kn} = 0.005\) at \(\kappa = 5\), then it becomes \(\kappa \approx 0.025 /\text{Kn}\)
\item Although if turbulent mean free path < size of acceleration region, then this would also make kappa larger for a given Kn
\end{itemize}
\end{itemize}
\end{itemize}
\end{document}
